<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b32759c0a782c9a70f307b7e7abf3469290314bb8a8a1f0cf1be207c09db45a9","plan_job_ref":"Job terraform plan #65 at https://github.com/suzutan/infra/actions/runs/11609503236","plan_out_hash":"9ddc56e96f56a3aa347e7721657db05441458240c4b8355a6a0f1e88051f2f14","plan_hash":"141d53d47bf1fbdc72daed658f1d9c8607d679ef7a244a1217d8d2c3a81bf38e","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # cloudflare_record.k8s_ingress["influxdb.harvestasya.org"] will be created
+   resource "cloudflare_record" "k8s_ingress" {
+       allow_overwrite = false
+       content         = "54cd8f65-9a2d-42ec-90f4-b8b3425e0d46.cfargotunnel.com"
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "influxdb.harvestasya.org"
+       proxiable       = (known after apply)
+       proxied         = true
+       ttl             = (known after apply)
+       type            = "CNAME"
+       value           = (known after apply)
+       zone_id         = "********************************"
    }

  # cloudflare_record.k8s_ingress["influxdb2.harvestasya.org"] will be destroyed
  # (because key ["influxdb2.harvestasya.org"] is not in for_each map)
-   resource "cloudflare_record" "k8s_ingress" {
-       allow_overwrite = false -> null
-       content         = "54cd8f65-9a2d-42ec-90f4-b8b3425e0d46.cfargotunnel.com" -> null
-       created_on      = "2024-10-22T16:22:50.967378Z" -> null
-       hostname        = "influxdb2.harvestasya.org" -> null
-       id              = "487ee83376ce07e8165a59a6b9922fa0" -> null
-       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> null
-       modified_on     = "2024-10-22T16:22:50.967378Z" -> null
-       name            = "influxdb2.harvestasya.org" -> null
-       proxiable       = true -> null
-       proxied         = true -> null
-       ttl             = 1 -> null
-       type            = "CNAME" -> null
-       zone_id         = "98fc606abe946efeabebe1fdbf0af490" -> null
#        (1 unchanged attribute hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
        id         = "54cd8f65-9a2d-42ec-90f4-b8b3425e0d46"
#        (2 unchanged attributes hidden)

!~      config {
!~          ingress_rule {
!~              hostname = "influxdb2.harvestasya.org" -> "influxdb.harvestasya.org"
#                (2 unchanged attributes hidden)

!~              origin_request {
!~                  http_host_header         = "influxdb2.harvestasya.org" -> "influxdb.harvestasya.org"
!~                  origin_server_name       = "influxdb2.harvestasya.org" -> "influxdb.harvestasya.org"
#                    (14 unchanged attributes hidden)
                }
            }

#            (7 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #65](https://github.com/suzutan/infra/actions/runs/11609503236)